; domain
(define (domain gripper-strips)
 (:requirements :strips :typing) 
 (:types room object robot gripper)
 (:predicates (at-robby ?r - robot ?x - room)
 	      (at ?o - object ?x - room)
	      (free ?r - robot ?g - gripper)
	      (carry ?r - robot ?o - object ?g - gripper))

   (:action move
       :parameters  (?r - robot ?from ?to - room)
       :precondition (and  (at-robby ?r ?from))
       :effect (and  (at-robby ?r ?to)
		     (not (at-robby ?r ?from))))

   (:action pick
       :parameters (?r - robot ?obj - object ?room - room ?g - gripper)
       :precondition  (and  (at ?obj ?room) (at-robby ?r ?room) (free ?r ?g))
       :effect (and (carry ?r ?obj ?g)
		    (not (at ?obj ?room)) 
		    (not (free ?r ?g))))

   (:action drop
       :parameters (?r - robot ?obj - object ?room - room ?g - gripper)
       :precondition  (and  (carry ?r ?obj ?g) (at-robby ?r ?room))
       :effect (and (at ?obj ?room)
		    (free ?r ?g)
		    (not (carry ?r ?obj ?g)))))

; problem
(define (problem gripper-2-15-13)
(:domain gripper-strips)
(:objects robot1 robot2 - robot
rgripper1 lgripper1 rgripper2 lgripper2 - gripper
room1 room2 room3 room4 room5 room6 room7 room8 room9 room10 room11 room12 room13 room14 room15 - room
ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 - object)
(:init
(at-robby robot1 room12)
(free robot1 rgripper1)
(free robot1 lgripper1)
(at-robby robot2 room6)
(free robot2 rgripper2)
(free robot2 lgripper2)
(at ball1 room4)
(at ball2 room11)
(at ball3 room12)
(at ball4 room14)
(at ball5 room2)
(at ball6 room2)
(at ball7 room11)
(at ball8 room5)
(at ball9 room2)
(at ball10 room7)
(at ball11 room15)
(at ball12 room3)
(at ball13 room1)
)
(:goal
(and
(at ball1 room6)
(at ball2 room5)
(at ball3 room1)
(at ball4 room13)
(at ball5 room1)
(at ball6 room10)
(at ball7 room3)
(at ball8 room2)
(at ball9 room6)
(at ball10 room6)
(at ball11 room2)
(at ball12 room3)
(at ball13 room9)
)
)
)

; plan
1. (pick robot1 ball3 room12 lgripper1)
   deleted: (at ball3 room12) (free robot1 lgripper1)
   added: (carry robot1 ball3 lgripper1)
   goals met: 1 of 13
2. (move robot2 room6 room7)
   deleted: (at-robby robot2 room6)
   added: (at-robby robot2 room7)
   goals met: 1 of 13
3. (move robot1 room12 room1)
   deleted: (at-robby robot1 room12)
   added: (at-robby robot1 room1)
   goals met: 1 of 13
4. (pick robot2 ball10 room7 lgripper2)
   deleted: (at ball10 room7) (free robot2 lgripper2)
   added: (carry robot2 ball10 lgripper2)
   goals met: 1 of 13
5. (drop robot1 ball3 room1 lgripper1)
   deleted: (carry robot1 ball3 lgripper1)
   added: (at ball3 room1) (free robot1 lgripper1)
   goals met: 2 of 13
6. (move robot2 room7 room4)
   deleted: (at-robby robot2 room7)
   added: (at-robby robot2 room4)
   goals met: 2 of 13
7. (pick robot1 ball13 room1 rgripper1)
   deleted: (at ball13 room1) (free robot1 rgripper1)
   added: (carry robot1 ball13 rgripper1)
   goals met: 2 of 13
8. (move robot1 room1 room9)
   deleted: (at-robby robot1 room1)
   added: (at-robby robot1 room9)
   goals met: 2 of 13
9. (pick robot2 ball1 room4 rgripper2)
   deleted: (at ball1 room4) (free robot2 rgripper2)
   added: (carry robot2 ball1 rgripper2)
   goals met: 2 of 13
10. (drop robot1 ball13 room9 rgripper1)
   deleted: (carry robot1 ball13 rgripper1)
   added: (at ball13 room9) (free robot1 rgripper1)
   goals met: 3 of 13
11. (move robot2 room4 room6)
   deleted: (at-robby robot2 room4)
   added: (at-robby robot2 room6)
   goals met: 3 of 13
12. (move robot1 room9 room6)
   deleted: (at-robby robot1 room9)
   added: (at-robby robot1 room6)
   goals met: 3 of 13
13. (drop robot2 ball1 room6 rgripper2)
   deleted: (carry robot2 ball1 rgripper2)
   added: (at ball1 room6) (free robot2 rgripper2)
   goals met: 4 of 13
14. (drop robot2 ball10 room6 lgripper2)
   deleted: (carry robot2 ball10 lgripper2)
   added: (at ball10 room6) (free robot2 lgripper2)
   goals met: 5 of 13
15. (move robot2 room6 room14)
   deleted: (at-robby robot2 room6)
   added: (at-robby robot2 room14)
   goals met: 5 of 13
16. (move robot1 room6 room5)
   deleted: (at-robby robot1 room6)
   added: (at-robby robot1 room5)
   goals met: 5 of 13
17. (pick robot2 ball4 room14 lgripper2)
   deleted: (at ball4 room14) (free robot2 lgripper2)
   added: (carry robot2 ball4 lgripper2)
   goals met: 5 of 13
18. (pick robot1 ball8 room5 lgripper1)
   deleted: (at ball8 room5) (free robot1 lgripper1)
   added: (carry robot1 ball8 lgripper1)
   goals met: 5 of 13
19. (move robot2 room14 room13)
   deleted: (at-robby robot2 room14)
   added: (at-robby robot2 room13)
   goals met: 5 of 13
20. (move robot1 room5 room2)
   deleted: (at-robby robot1 room5)
   added: (at-robby robot1 room2)
   goals met: 5 of 13
21. (drop robot2 ball4 room13 lgripper2)
   deleted: (carry robot2 ball4 lgripper2)
   added: (at ball4 room13) (free robot2 lgripper2)
   goals met: 6 of 13
22. (drop robot1 ball8 room2 lgripper1)
   deleted: (carry robot1 ball8 lgripper1)
   added: (at ball8 room2) (free robot1 lgripper1)
   goals met: 7 of 13
23. (pick robot1 ball9 room2 rgripper1)
   deleted: (at ball9 room2) (free robot1 rgripper1)
   added: (carry robot1 ball9 rgripper1)
   goals met: 7 of 13
24. (move robot1 room2 room6)
   deleted: (at-robby robot1 room2)
   added: (at-robby robot1 room6)
   goals met: 7 of 13
25. (move robot2 room13 room5)
   deleted: (at-robby robot2 room13)
   added: (at-robby robot2 room5)
   goals met: 7 of 13
26. (drop robot1 ball9 room6 rgripper1)
   deleted: (carry robot1 ball9 rgripper1)
   added: (at ball9 room6) (free robot1 rgripper1)
   goals met: 8 of 13
27. (move robot2 room5 room2)
   deleted: (at-robby robot2 room5)
   added: (at-robby robot2 room2)
   goals met: 8 of 13
28. (move robot1 room6 room11)
   deleted: (at-robby robot1 room6)
   added: (at-robby robot1 room11)
   goals met: 8 of 13
29. (pick robot2 ball6 room2 lgripper2)
   deleted: (at ball6 room2) (free robot2 lgripper2)
   added: (carry robot2 ball6 lgripper2)
   goals met: 8 of 13
30. (pick robot2 ball5 room2 rgripper2)
   deleted: (at ball5 room2) (free robot2 rgripper2)
   added: (carry robot2 ball5 rgripper2)
   goals met: 8 of 13
31. (pick robot1 ball7 room11 lgripper1)
   deleted: (at ball7 room11) (free robot1 lgripper1)
   added: (carry robot1 ball7 lgripper1)
   goals met: 8 of 13
32. (pick robot1 ball2 room11 rgripper1)
   deleted: (at ball2 room11) (free robot1 rgripper1)
   added: (carry robot1 ball2 rgripper1)
   goals met: 8 of 13
33. (move robot2 room2 room10)
   deleted: (at-robby robot2 room2)
   added: (at-robby robot2 room10)
   goals met: 8 of 13
34. (move robot1 room11 room5)
   deleted: (at-robby robot1 room11)
   added: (at-robby robot1 room5)
   goals met: 8 of 13
35. (drop robot2 ball6 room10 lgripper2)
   deleted: (carry robot2 ball6 lgripper2)
   added: (at ball6 room10) (free robot2 lgripper2)
   goals met: 9 of 13
36. (drop robot1 ball2 room5 rgripper1)
   deleted: (carry robot1 ball2 rgripper1)
   added: (at ball2 room5) (free robot1 rgripper1)
   goals met: 10 of 13
37. (move robot2 room10 room2)
   deleted: (at-robby robot2 room10)
   added: (at-robby robot2 room2)
   goals met: 10 of 13
38. (move robot1 room5 room3)
   deleted: (at-robby robot1 room5)
   added: (at-robby robot1 room3)
   goals met: 10 of 13
39. (move robot2 room2 room15)
   deleted: (at-robby robot2 room2)
   added: (at-robby robot2 room15)
   goals met: 10 of 13
40. (drop robot1 ball7 room3 lgripper1)
   deleted: (carry robot1 ball7 lgripper1)
   added: (at ball7 room3) (free robot1 lgripper1)
   goals met: 11 of 13
41. (pick robot2 ball11 room15 lgripper2)
   deleted: (at ball11 room15) (free robot2 lgripper2)
   added: (carry robot2 ball11 lgripper2)
   goals met: 11 of 13
42. (move robot2 room15 room2)
   deleted: (at-robby robot2 room15)
   added: (at-robby robot2 room2)
   goals met: 11 of 13
43. (drop robot2 ball11 room2 lgripper2)
   deleted: (carry robot2 ball11 lgripper2)
   added: (at ball11 room2) (free robot2 lgripper2)
   goals met: 12 of 13
44. (move robot2 room2 room1)
   deleted: (at-robby robot2 room2)
   added: (at-robby robot2 room1)
   goals met: 12 of 13
45. (drop robot2 ball5 room1 rgripper2)
   deleted: (carry robot2 ball5 rgripper2)
   added: (at ball5 room1) (free robot2 rgripper2)
   goals met: 13 of 13
